app/controllers/admin/categories_controller.rb

SELECT * FROM `categories` WHERE (parent_id = '4')
SELECT * FROM `categories` WHERE (`categories`.`id` = '4') LIMIT 1
---
  def show
      @categories = Category.find_sub(params[:id])
      #@subcategories = @category.subcategories
      @parent = Category.find_by_id(params[:id])