app/controllers/admin/galleries_controller.rb

  def show
    @gallery = Gallery.find_by_id(params[:id])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = '10') LIMIT 1

  def new
    @property = Property.find_by_id(params[:property_id])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = '3') LIMIT 1

  def create
    @gallery = Gallery.new params[:gallery]

       if @gallery.save
---
INSERT INTO `galleries` (`updated_at`, `title`, `property_id`, `description`, `created_at`) VALUES('2009-11-11 13:14:41', 'test', 3, NULL, '2009-11-11 13:14:41')

  def destroy
    @gallery = Gallery.find_by_id(params[:id])
    @gallery.destroy
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = '10') LIMIT 1
DELETE FROM `galleries` WHERE `id` = 10