app/controllers/admin/overview_controller.rb

  def index
    @pages = Page.find(:all)
    @categories = Category.find_main
---
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position
SELECT * FROM `categories` WHERE (parent_id IS NULL) ORDER BY position