app/controllers/admin/pages_controller.rb

  def index
     @pagetitle = "Admin - Static pages"
     @pages = Page.all
---
SELECT * FROM `pages` WHERE (parent_id IS NULL) ORDER BY position