app/controllers/properties_controller.rb

  def index

     @properties = Property.find(:all, :include => 'location',:order => 'locations.region')
     @page = Page.find_by_name('properties')
---
SELECT * FROM `pages` WHERE (`pages`.`name` = 'properties') LIMIT 1

  def show

    @property = Property.find_by_id(params[:id])
    @page = Page.find_by_name('properties')
---
SELECT * FROM `properties` WHERE (`properties`.`id` = '3') LIMIT 1
SELECT * FROM `pages` WHERE (`pages`.`name` = 'properties') LIMIT 1