app/controllers/services_controller.rb

  def index
    @page = Page.find_by_name('services')
    @categories = Category.find_main
---
SELECT * FROM `pages` WHERE (`pages`.`name` = 'services') LIMIT 1
SELECT * FROM `categories` WHERE (parent_id IS NULL) ORDER BY position