app/controllers/viewer_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`name` = 'home') LIMIT 1
---
  def show
    @page = Page.find_by_name(params[:name])